pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/eUSCI_B2_208.0.xml
    <register id="UCB2IE_SPI" width="16" offset="0x2A" internal="0" description="eUSCI_Bx Interrupt Enable Register">
        <bitfield id="UCRXIE" description="Receive interrupt enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCRXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXIE" description="Transmit interrupt enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="UCB2IFG" width="16" offset="0x2C" internal="0" description="eUSCI_Bx Interrupt Flag Register">
        <bitfield id="UCRXIFG0" description="eUSCI_B receive interrupt flag 0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIFG0_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG0_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXIFG0" description="eUSCI_B transmit interrupt flag 0" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIFG0_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXIFG0_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCSTTIFG" description="START condition interrupt flag" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCSTTIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCSTTIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCSTPIFG" description="STOP condition interrupt flag" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCSTPIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCSTPIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCALIFG" description="Arbitration lost interrupt flag" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="UCALIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCALIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCNACKIFG" description="Not-acknowledge received interrupt flag" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCNACKIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCNACKIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCBCNTIFG" description="Byte counter interrupt flag" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="UCBCNTIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCBCNTIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCCLTOIFG" description="Clock low timeout interrupt flag" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="UCCLTOIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCCLTOIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCRXIFG1" description="eUSCI_B receive interrupt flag 1" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="UCRXIFG1_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG1_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXIFG1" description="eUSCI_B transmit interrupt flag 1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="UCTXIFG1_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXIFG1_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCRXIFG2" description="eUSCI_B receive interrupt flag 2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="UCRXIFG2_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG2_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXIFG2" description="eUSCI_B transmit interrupt flag 2" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="UCTXIFG2_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXIFG2_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCRXIFG3" description="eUSCI_B receive interrupt flag 3" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="UCRXIFG3_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG3_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXIFG3" description="eUSCI_B transmit interrupt flag 3" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="UCTXIFG3_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXIFG3_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCBIT9IFG" description="Bit position 9 interrupt flag" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="UCBIT9IFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCBIT9IFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
    <register id="UCB2IFG_SPI" width="16" offset="0x2C" internal="0" description="eUSCI_Bx Interrupt Flag Register">
        <bitfield id="UCRXIFG" description="Receive interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXIFG" description="Transmit interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
    <register id="UCB2IV" width="16" offset="0x2E" internal="0" description="eUSCI_Bx Interrupt Vector Register">
        <bitfield id="UCIV" description="eUSCI_B interrupt vector value" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCALIFG" value="0x2" description="Interrupt Source: Arbitration lost; Interrupt Flag: UCALIFG; Interrupt Priority: Highest"/>
            <bitenum id="UCNACKIFG" value="0x4" description="Interrupt Source: Not acknowledgment; Interrupt Flag: UCNACKIFG"/>
            <bitenum id="UCSTTIFG" value="0x6" description="Interrupt Source: Start condition received; Interrupt Flag: UCSTTIFG"/>
            <bitenum id="UCSTPIFG" value="0x8" description="Interrupt Source: Stop condition received; Interrupt Flag: UCSTPIFG"/>
            <bitenum id="UCRXIFG3" value="0xA" description="Interrupt Source: Slave 3 Data received; Interrupt Flag: UCRXIFG3"/>
            <bitenum id="UCTXIFG3" value="0xC" description="Interrupt Source: Slave 3 Transmit buffer empty; Interrupt Flag: UCTXIFG3"/>
            <bitenum id="UCRXIFG2" value="0xE" description="Interrupt Source: Slave 2 Data received; Interrupt Flag: UCRXIFG2"/>
            <bitenum id="UCTXIFG2" value="0x10" description="Interrupt Source: Slave 2 Transmit buffer empty; Interrupt Flag: UCTXIFG2"/>
            <bitenum id="UCRXIFG1" value="0x12" description="Interrupt Source: Slave 1 Data received; Interrupt Flag: UCRXIFG1"/>
            <bitenum id="UCTXIFG1" value="0x14" description="Interrupt Source: Slave 1 Transmit buffer empty; Interrupt Flag: UCTXIFG1"/>
            <bitenum id="UCRXIFG0" value="0x16" description="Interrupt Source: Data received; Interrupt Flag: UCRXIFG0"/>
            <bitenum id="UCTXIFG0" value="0x18" description="Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG0"/>
            <bitenum id="UCBCNTIFG" value="0x1A" description="Interrupt Source: Byte counter zero; Interrupt Flag: UCBCNTIFG"/>
            <bitenum id="UCCLTOIFG" value="0x1C" description="Interrupt Source: Clock low timeout; Interrupt Flag: UCCLTOIFG"/>
            <bitenum id="UCBIT9IFG" value="0x1E" description="Interrupt Source: Nineth bit position; Interrupt Flag: UCBIT9IFG; Priority: Lowest"/>
        </bitfield>
    </register>
    <register id="UCB2IV_SPI" width="16" offset="0x2E" internal="0" description="eUSCI_Bx Interrupt Vector Register">
        <bitfield id="UCIV" description="eUSCI_B interrupt vector value" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG" value="0x2" description="Interrupt Source: Data received; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest"/>
            <bitenum id="UCTXIFG" value="0x4" description="Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG; Interrupt Priority: Lowest"/>
        </bitfield>
    </register>
</module>
